HELYXcore-4.4.0/examples/legacy/incompressible/pimpleDyMFoam/mixerVesselAMI2D/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//- Force AMI to be on single processor. Can cause imbalance with some
//  decomposers.
//singleProcessorFaceSets ((AMI -1));

numberOfSubdomains 4;

method          scotch;

distributed     no;

roots           ( );


// ************************************************************************* //
