HELYXcore-4.4.0/examples/legacy/incompressible/pimpleDyMFoam/mixerVesselAMI2D/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Get both sides of ami
    // ~~~~~~~~~~~~~~~~~~~~~

    // Get all faces in cellSet
    {
        name    AMI;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name "AMI.*";
        }
    }
);

// ************************************************************************* //
